#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-prod-sso-requests/runs/run-nuwphyXdJhNTWh4F

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=7pXWFg]
aws_api_gateway_method.actions: Refreshing state... [id=agm-kgodz1zmk2-vw6kd8-ANY]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kgodz1zmk2]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210903190658559400000001]
aws_api_gateway_resource.app: Refreshing state... [id=sniyra]
aws_api_gateway_resource.actions: Refreshing state... [id=vw6kd8]
aws_api_gateway_resource.proxy: Refreshing state... [id=aqhevc]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-kgodz1zmk2-aqhevc-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-006d5ccf7acdb99cc]
aws_security_group.rds_sg: Refreshing state... [id=sg-0cbc5116a7eb44966]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-3019186098]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-kgodz1zmk2-vw6kd8-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-kgodz1zmk2-aqhevc-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.this: Refreshing state... [id=4506w6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.app has been changed
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-03-09T22:06:01.000+0000" -> "2022-03-11T00:52:12.000+0000"
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GH_ACCESS_TOKEN"             = "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" -> "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"
                # (28 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }
  # aws_lambda_function.actions has been changed
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-03-09T22:06:07.000+0000" -> "2022-03-11T00:49:39.000+0000"
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GH_ACCESS_TOKEN"     = "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" -> "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"
                # (12 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-03-09T22:06:22.728Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
-/+ resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2021-08-10T23:56:57Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:751704728437:kgodz1zmk2/test" -> (known after apply)
      ~ id            = "4506w6" -> (known after apply)
      ~ invoke_url    = "https://kgodz1zmk2.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "dc0f8dfdd37c55320f1a9011835a2b855335cdd9"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.actions must be replaced
-/+ resource "aws_api_gateway_integration" "actions" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "vw6kd8" -> (known after apply)
      ~ id                      = "agi-kgodz1zmk2-vw6kd8-ANY" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "vw6kd8" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_method.actions will be destroyed
  - resource "aws_api_gateway_method" "actions" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "ANY" -> null
      - id                   = "agm-kgodz1zmk2-vw6kd8-ANY" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "vw6kd8" -> null
      - rest_api_id          = "kgodz1zmk2" -> null
    }

  # aws_api_gateway_method.actions_proxy will be created
  + resource "aws_api_gateway_method" "actions_proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kgodz1zmk2"
    }

  # aws_api_gateway_resource.actions_proxy will be created
  + resource "aws_api_gateway_resource" "actions_proxy" {
      + id          = (known after apply)
      + parent_id   = "vw6kd8"
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = "kgodz1zmk2"
    }

  # aws_cloudwatch_event_rule.scheduler will be created
  + resource "aws_cloudwatch_event_rule" "scheduler" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "tf-apply-scheduler"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.scheduler will be created
  + resource "aws_cloudwatch_event_target" "scheduler" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "tf-apply-scheduler"
      + target_id      = "scheduler"
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
      ~ handler                        = "actions/src/main.handler" -> "index.handler"
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-03-11T00:49:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "tGEcHH3o3Xi4vFkNqxnzVHkAhZAv9azI88iJTRsHC4I=" -> "2wCFxxGS/OacUTKh26KYpl+JPp1hbkU8TPm0Z4i5Srw="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
      ~ handler                        = "lambda/app/src/main.handler" -> "index.handler"
        id                             = "lambda-app"
      ~ last_modified                  = "2022-03-11T00:52:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "Xal/zudwkaMAxLP6LCoHUg9vwCWBPEQtg9TU/JYt1x0=" -> "Afa1A96eBQX+xY9jPkk+0iRQomyOQle9zXNn/DXEoL8="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
      ~ handler                        = "db/src/main.handler" -> "index.handler"
        id                             = "lambda-db"
      ~ last_modified                  = "2022-03-09T22:06:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "OMwDGkQpwuZcnOHHYfwuN7M6atmmOJYYseC70kYM0FI=" -> "hhLneVgxG2OiLHTLP4mOeNuUPrLhmNizW7cCA+qhw64="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be created
  + resource "aws_lambda_function" "scheduler" {
      + arn                            = (known after apply)
      + filename                       = "lambda-scheduler.zip"
      + function_name                  = "lambda-scheduler"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::751704728437:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "nMzoU1DCmgQCz8r67xmxJdjr3vzrOkYSr6JJdp2mTHI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "managed-by" = "terraform"
        }
      + tags_all                       = {
          + "managed-by" = "terraform"
        }
      + timeout                        = 45
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GH_ACCESS_TOKEN" = "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"
              + "GH_BRANCH"       = "main"
              + "GH_OWNER"        = "bcgov"
              + "GH_REPO"         = "sso_terraform"
              + "GH_WORKFLOW_ID"  = "terraform-apply.yml"
              + "NODE_ENV"        = "production"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0cbc5116a7eb44966",
            ]
          + subnet_ids         = [
              + "subnet-0b7cfc2250fbc9009",
              + "subnet-0bace7fcb69dcfb23",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.scheduler will be created
  + resource "aws_lambda_permission" "scheduler" {
      + action        = "lambda:InvokeFunction"
      + function_name = "lambda-scheduler"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 8 to add, 3 to change, 3 to destroy.

Changes to Outputs:
  ~ base_url     = "https://kgodz1zmk2.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-03-09T22:06:22.728Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*